temp/app/controllers/wifisets_controller.rb

  def create
    @wifiset = Wifiset.new(wifiset_params)
    puts @wifiset.ssid
    client = TCPSocket.new 'localhost', 9990
    makeSSIDjson = {:SSID => @wifiset.ssid, :PW => @wifiset.pass}
    client.puts JSON.generate(makeSSIDjson)
    while line = client.gets
	puts line
    end
    client.close

	#my_wifi_set = {:ssid => @wifiset.ssid}
    #puts my_wifi_set



    respond_to do |format|
      if @wifiset.save
---
INSERT INTO "wifisets" ("ssid", "pass", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ssid", "sss"], ["pass", "zzzz"], ["created_at", "2016-10-13 12:40:45.505820"], ["updated_at", "2016-10-13 12:40:45.505820"]]

    def set_wifiset
      @wifiset = Wifiset.find(params[:id])
---
SELECT  "wifisets".* FROM "wifisets" WHERE "wifisets"."id" = ? LIMIT 1  [["id", 1]]